task.branching.comparison =  \u0421\u043E\u0441\u0442\u0430\u0432\u0438\u0442\u044C \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0443 \u0441\u0440\u0430\u0432\u043D\u0435\u043D\u0438\u044F \u0434\u0432\u0443\u0445 \u0447\u0438\u0441\u0435\u043B 1 \u0438 2. \u0415\u0441\u043B\u0438 1 \u043C\u0435\u043D\u044C\u0448\u0435 2 \u2013 \u0432\u044B\u0432\u0435\u0441\u0442\u0438 \u043D\u0430 \u044D\u043A\u0440\u0430\u043D \u0441\u043B\u043E\u0432\u043E \u00AByes\u00BB, \u0432 \u043F\u0440\u043E\u0442\u0438\u0432\u043D\u043E\u043C \u0441\u043B\u0443\u0447\u0430\u0435 \u2013 \u0441\u043B\u043E\u0432\u043E \u00ABno\u00BB
task.branching.replacement = \u0414\u0430\u043D\u044B \u0446\u0435\u043B\u044B\u0435 \u0447\u0438\u0441\u043B\u0430 \u0442, \u043F. \u0415\u0441\u043B\u0438 \u0447\u0438\u0441\u043B\u0430 \u043D\u0435 \u0440\u0430\u0432\u043D\u044B, \u0442\u043E \u0437\u0430\u043C\u0435\u043D\u0438\u0442\u044C \u043A\u0430\u0436\u0434\u043E\u0435 \u0438\u0437 \u043D\u0438\u0445 \u043E\u0434\u043D\u0438\u043C \u0438 \u0442\u0435\u043C \u0436\u0435 \u0447\u0438\u0441\u043B\u043E\u043C, \u0440\u0430\u0432\u043D\u044B\u043C \u0431\u043E\u043B\u044C\u0448\u0435\u043C\u0443 \u0438\u0437 \u0438c\u0445\u043E\u0434\u043D\u044B\u0445, \u0430 \u0435\u0441\u043B\u0438 \u0440\u0430\u0432\u043D\u044B, \u0442\u043E \u0437\u0430\u043C\u0435\u043D\u0438\u0442\u044C \u0447\u0438\u0441\u043B\u0430 \u043D\u0443\u043B\u044F\u043C\u0438.
task.branching.square = \u0414\u0430\u043D\u044B \u0442\u0440\u0438 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0445 \u0447\u0438\u0441\u043B\u0430. \u0412\u043E\u0437\u0432\u0435\u0441\u0442\u0438 \u0432 \u043A\u0432\u0430\u0434\u0440\u0430\u0442 \u0442\u0435 \u0438\u0437 \u043D\u0438\u0445, \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u043D\u0435\u043E\u0442\u0440\u0438\u0446\u0430\u0442\u0435\u043B\u044C\u043D\u044B, \u0438 \u0432 \u0447\u0435\u0442\u0432\u0435\u0440\u0442\u0443\u044E \u0441\u0442\u0435\u043F\u0435\u043D\u044C \u2014 \u043E\u0442\u0440\u0438\u0446\u0430\u0442\u0435\u043B\u044C\u043D\u044B\u0435.
task.branching.function = \u0412\u044B\u0447\u0438\u0441\u043B\u0438\u0442\u044C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0444\u0443\u043D\u043A\u0446\u0438\u0438 f(x)
task.branching.max_min = \u041D\u0430\u0439\u0442\u0438 max{min(a, b), min(c, d)}.

task.cycle.numbers = \u041D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0432\u044B\u0432\u0435\u0441\u0442\u0438 \u043D\u0430 \u044D\u043A\u0440\u0430\u043D \u0447\u0438\u0441\u043B\u0430 \u043E\u0442 5 \u0434\u043E 1
task.cycle.subsequence = \u041F\u043E\u0441\u043B\u0435\u0434\u043E\u0432\u0430\u0442\u0435\u043B\u044C\u043D\u043E\u0441\u0442\u044C \u0430n \u0441\u0442\u0440\u043E\u0438\u0442\u0441\u044F \u0442\u0430\u043A: \u04301 = 1, an =6+ \u0430n-1 , \u0434\u043B\u044F \u043A\u0430\u0436\u0434\u043E\u0433\u043E n >1 \u0421\u043E\u0441\u0442\u0430\u0432\u044C\u0442\u0435 \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0443 \u043D\u0430\u0445\u043E\u0436\u0434\u0435\u043D\u0438\u044F \u043F\u0440\u043E\u0438\u0437\u0432\u0435\u0434\u0435\u043D\u0438\u044F \u043F\u0435\u0440\u0432\u044B\u0445 10 \u0447\u043B\u0435\u043D\u043E\u0432 \u044D\u0442\u043E\u0439 \u043F\u043E\u0441\u043B\u0435\u0434\u043E\u0432\u0430\u0442\u0435\u043B\u044C\u043D\u043E\u0441\u0442\u0438.
task.cycle.function = \u0414\u0430\u043D\u044B \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043B\u044C\u043D\u043E\u0435 (\u0430) \u0438 \u043D\u0430\u0442\u0443\u0440\u0430\u043B\u044C\u043D\u043E\u0435 (n). \u0432\u044B\u0447\u0438\u0441\u043B\u0438\u0442\u044C: a(a+1)...(a+n-1)
task.cycle.dividers = \u0414\u043B\u044F \u043A\u0430\u0436\u0434\u043E\u0433\u043E \u043D\u0430\u0442\u0443\u0440\u0430\u043B\u044C\u043D\u043E\u0433\u043E \u0447\u0438\u0441\u043B\u0430 \u0432 \u043F\u0440\u043E\u043C\u0435\u0436\u0443\u0442\u043A\u0435 \u043E\u0442 m \u0434\u043E n \u0432\u044B\u0432\u0435\u0441\u0442\u0438 \u0432\u0441\u0435 \u0434\u0435\u043B\u0438\u0442\u0435\u043B\u0438, \u043A\u0440\u043E\u043C\u0435 \u0435\u0434\u0438\u043D\u0438\u0446\u044B \u0438 \u0441\u0430\u043C\u043E\u0433\u043E \u0447\u0438\u0441\u043B\u0430. m \u0438 n \u0432\u0432\u043E\u0434\u044F\u0442\u0441\u044F \u0441 \u043A\u043B\u0430\u0432\u0438\u0430\u0442\u0443\u0440\u044B
task.cycle.problem = \u0414\u0430\u043D\u044B \u0434\u0432\u0430 \u0434\u0432\u0443\u0437\u043D\u0430\u0447\u043D\u044B\u0445 \u0447\u0438\u0441\u043B\u0430 \u0410 \u0438 \u0412. \u0418\u0437 \u044D\u0442\u0438\u0445 \u0447\u0438\u0441\u0435\u043B \u0441\u043E\u0441\u0442\u0430\u0432\u0438\u043B\u0438 2 \u0447\u0435\u0442\u044B\u0440\u0435\u0445\u0437\u043D\u0430\u0447\u043D\u044B\u0445 \u0447\u0438\u0441\u043B\u0430: \u043F\u0435\u0440\u0432\u043E\u0435 \u0447\u0438\u0441\u043B\u043E \u043F\u043E\u043B\u0443\u0447\u0438\u043B\u0438 \u043F\u0443\u0442\u0435\u043C \u043D\u0430\u043F\u0438\u0441\u0430\u043D\u0438\u044F \u0441\u043D\u0430\u0447\u0430\u043B\u0430 \u0447\u0438\u0441\u043B\u0430 \u0410, \u0437\u0430\u0442\u0435\u043C \u0412. \u0414\u043B\u044F \u043F\u043E\u043B\u0443\u0447\u0435\u043D\u0438\u044F \u0432\u0442\u043E\u0440\u043E\u0433\u043E \u0447\u0438\u0441\u043B\u0430 \u0441\u043D\u0430\u0447\u0430\u043B\u0430 \u0437\u0430\u043F\u0438\u0441\u0430\u043B\u0438 \u0447\u0438\u0441\u043B\u043E \u0412, \u0437\u0430\u0442\u0435\u043C \u0410. \u041D\u0430\u0439\u0442\u0438 \u0447\u0438\u0441\u043B\u0430 \u0410 \u0438 \u0412 \u0435\u0441\u043B\u0438 \u0438\u0437\u0432\u0435\u0441\u0442\u043D\u043E , \u0447\u0442\u043E \u043F\u0435\u0440\u0432\u043E\u0435 \u0447\u0435\u0442\u044B\u0440\u0435\u0445\u0437\u043D\u0430\u0447\u043D\u043E\u0435 \u0447\u0438\u0441\u043B\u043E \u043D\u0430\u0446\u0435\u043B\u043E \u0434\u0435\u043B\u0438\u0442\u0441\u044F \u043D\u0430 99, \u0430 \u0432\u0442\u043E\u0440\u043E\u0435 \u043D\u0430 49.

main.menu = \u0413\u043B\u0430\u0432\u043D\u043E\u0435 \u043C\u0435\u043D\u044E

task.cycle = \u0417\u0430\u0434\u0430\u043D\u0438\u044F \u043D\u0430 \u0446\u0438\u043A\u043B\u044B
task.branching = \u0417\u0430\u0434\u0430\u043D\u0438\u044F \u043D\u0430 \u0440\u0430\u0437\u0432\u0438\u043B\u043A\u0438
lang.choice = \u0418\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u044F\u0437\u044B\u043A
main.exit = \u0412\u044B\u0439\u0442\u0438
main.back = \u041D\u0430\u0437\u0430\u0434
main.choice.from_file_or_menu = \u0412\u044B\u0431\u043E\u0440 \u0447\u0442\u0435\u043D\u0438\u044F \u0434\u0430\u043D\u043D\u044B\u0445
main.choice.from_file = \u0418\u0437 \u0444\u0430\u0439\u043B\u0430
main.choice.from_console = \u0421 \u043A\u043E\u043D\u0441\u043E\u043B\u0438
main.please.input = \u0412\u0432\u0435\u0434\u0438\u0442\u0435

main.menu.branching = \u0420\u0430\u0437\u0432\u0438\u043B\u043A\u0438
main.menu.cycle = \u0426\u0438\u043A\u043B\u044B

main.unknown_command = \u041D\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043D\u0430\u044F \u043A\u043E\u043C\u043C\u043C\u0430\u0434\u043D\u0430, \u043F\u043E\u043F\u0440\u043E\u0431\u0443\u0439\u0442\u0435 \u0435\u0449\u0435

main.error.failed_to_start = \u041D\u0435 \u0443\u0434\u0430\u043B\u043E\u0441\u044C \u0437\u0430\u043F\u0443\u0441\u0442\u0438\u0442\u044C \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435
